In [58]:
import numpy as np
import pandas as pd

In [59]:
tup = ( 34,35, 'irfan', 2)
tup

(34, 35, 'irfan', 2)

In [60]:
type(tup)

tuple

In [61]:
l1= [ 'ss', 34 ,'35f', 345]
l1

['ss', 34, '35f', 345]

In [62]:
type(l1)

list

In [63]:
tup2 = ( 34,35, 'irfan', 234)
t= tup+ tup2
t

(34, 35, 'irfan', 2, 34, 35, 'irfan', 234)

In [64]:
tp=tuple(l1)
tp

('ss', 34, '35f', 345)

In [65]:
type(tp)

tuple

In [66]:
rt=( 12,'moin', tp, l1, tup2)
rt

(12,
 'moin',
 ('ss', 34, '35f', 345),
 ['ss', 34, '35f', 345],
 (34, 35, 'irfan', 234))

In [67]:
type(rt)

tuple

In [68]:
dic= { 'Name': ('irfan', 'moin', 'saif', 'Mouiz')
      , 'age': (24, 23, 25, 27)
     , 'GPA': (3.54, 3.48, 3.44, 2.90)}
dic

{'Name': ('irfan', 'moin', 'saif', 'Mouiz'),
 'age': (24, 23, 25, 27),
 'GPA': (3.54, 3.48, 3.44, 2.9)}

In [69]:
df= pd.DataFrame(dic)
df

    Name  age   GPA
0  irfan   24  3.54
1   moin   23  3.48
2   saif   25  3.44
3  Mouiz   27  2.90

In [70]:
df

    Name  age   GPA
0  irfan   24  3.54
1   moin   23  3.48
2   saif   25  3.44
3  Mouiz   27  2.90

In [71]:
gf=df

In [72]:
gf

    Name  age   GPA
0  irfan   24  3.54
1   moin   23  3.48
2   saif   25  3.44
3  Mouiz   27  2.90

In [73]:
gf

gf.reindex()

    Name  age   GPA
0  irfan   24  3.54
1   moin   23  3.48
2   saif   25  3.44
3  Mouiz   27  2.90

In [74]:
gf

    Name  age   GPA
0  irfan   24  3.54
1   moin   23  3.48
2   saif   25  3.44
3  Mouiz   27  2.90

In [75]:
gf

    Name  age   GPA
0  irfan   24  3.54
1   moin   23  3.48
2   saif   25  3.44
3  Mouiz   27  2.90

In [76]:
gf.index=(35,25,34,400)

In [77]:
gf['Gdr']=('m','m','f','u')

In [78]:
gf

      Name  age   GPA Gdr
35   irfan   24  3.54   m
25    moin   23  3.48   m
34    saif   25  3.44   f
400  Mouiz   27  2.90   u

In [79]:
gf.iloc[2,2]

3.44

In [80]:
gf.iloc[[1,3],[3]]

    Gdr
25    m
400   u

In [81]:
gf

      Name  age   GPA Gdr
35   irfan   24  3.54   m
25    moin   23  3.48   m
34    saif   25  3.44   f
400  Mouiz   27  2.90   u

In [82]:
gf.drop([34], axis=0)
gf

      Name  age   GPA Gdr
35   irfan   24  3.54   m
25    moin   23  3.48   m
34    saif   25  3.44   f
400  Mouiz   27  2.90   u

In [83]:
zk={'Name':'Zakki', 
    'age':31, 
    'GPA':3.22,
    'Gdr':'f'}
zzk=gf.DataFrame(zk, index=(0))
zzk

AttributeError: 'DataFrame' object has no attribute 'DataFrame'

In [84]:
zuk=pd.DataFrame([['Zakki', 31, 3.20, 'f']])

In [85]:
zuk.columns=('Name', 'age', 'GPA', 'Gdr')
zuk

    Name  age  GPA Gdr
0  Zakki   31  3.2   f

In [86]:
dat=pd.concat([gf, zuk])
dat

      Name  age   GPA Gdr
35   irfan   24  3.54   m
25    moin   23  3.48   m
34    saif   25  3.44   f
400  Mouiz   27  2.90   u
0    Zakki   31  3.20   f

In [87]:
dat.index=([1,2,3,4,5])
dat

    Name  age   GPA Gdr
1  irfan   24  3.54   m
2   moin   23  3.48   m
3   saif   25  3.44   f
4  Mouiz   27  2.90   u
5  Zakki   31  3.20   f

In [88]:
kat=dat.rename(columns={'Name':'tame'}, index={4:44})
kat

     tame  age   GPA Gdr
1   irfan   24  3.54   m
2    moin   23  3.48   m
3    saif   25  3.44   f
44  Mouiz   27  2.90   u
5   Zakki   31  3.20   f

In [89]:
for x in dat.columns:
    print (x)

Name
age
GPA
Gdr

In [90]:
for column_name, series in dat.items():
    print(column_name)
    print(series.values)

Name
['irfan' 'moin' 'saif' 'Mouiz' 'Zakki']
age
[24 23 25 27 31]
GPA
[3.54 3.48 3.44 2.9  3.2 ]
Gdr
['m' 'm' 'f' 'u' 'f']

In [91]:
for l, r in dat.items():
    print(l)
    print(r.values)

Name
['irfan' 'moin' 'saif' 'Mouiz' 'Zakki']
age
[24 23 25 27 31]
GPA
[3.54 3.48 3.44 2.9  3.2 ]
Gdr
['m' 'm' 'f' 'u' 'f']

In [92]:
for l,r in dat.iterrows():
    print(l,r)

1 Name    irfan
age        24
GPA      3.54
Gdr         m
Name: 1, dtype: object
2 Name    moin
age       23
GPA     3.48
Gdr        m
Name: 2, dtype: object
3 Name    saif
age       25
GPA     3.44
Gdr        f
Name: 3, dtype: object
4 Name    Mouiz
age        27
GPA       2.9
Gdr         u
Name: 4, dtype: object
5 Name    Zakki
age        31
GPA       3.2
Gdr         f
Name: 5, dtype: object

In [93]:
print('dat')

dat

In [94]:
dat

    Name  age   GPA Gdr
1  irfan   24  3.54   m
2   moin   23  3.48   m
3   saif   25  3.44   f
4  Mouiz   27  2.90   u
5  Zakki   31  3.20   f

In [100]:
dat

    Name  age   GPA Gdr
1  irfan   24  3.54   m
2   moin   23  3.48   m
3   saif   25  3.44   f
4  Mouiz   27  2.90   u
5  Zakki   31  3.20   f